---
kind: event
id: E:Autodesk.Revit.UI.UIControlledApplication.DisplayingOptionsDialog
source: html/ba28f50d-8545-5e3f-201b-605845c4ed29.htm
---
# Autodesk.Revit.UI.UIControlledApplication.DisplayingOptionsDialog Event

Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.

## Syntax (C#)
```csharp
public event EventHandler<DisplayingOptionsDialogEventArgs> DisplayingOptionsDialog
```